io-test/fio-output/libaio-irq-randwrite-16k-1-1-log
test: (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=431309: Mon Oct 21 17:40:25 2024
  write: IOPS=312k, BW=4872MiB/s (5109MB/s)(71.4GiB/15001msec); 0 zone resets
    slat (nsec): min=1980, max=135360, avg=2186.74, stdev=212.29
    clat (nsec): min=540, max=103660, avg=747.54, stdev=102.46
     lat (nsec): min=2620, max=143140, avg=2981.36, stdev=242.26
    clat percentiles (nsec):
     |  1.00th=[  732],  5.00th=[  732], 10.00th=[  740], 20.00th=[  740],
     | 30.00th=[  740], 40.00th=[  740], 50.00th=[  740], 60.00th=[  748],
     | 70.00th=[  748], 80.00th=[  748], 90.00th=[  748], 95.00th=[  764],
     | 99.00th=[  772], 99.50th=[  860], 99.90th=[ 1224], 99.95th=[ 2704],
     | 99.99th=[ 3888]
   bw (  MiB/s): min= 4861, max= 4899, per=100.00%, avg=4879.08, stdev=10.66, samples=29
   iops        : min=311138, max=313544, avg=312261.28, stdev=682.33, samples=29
  lat (nsec)   : 750=57.68%, 1000=42.13%
  lat (usec)   : 2=0.12%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=15.70%, sys=84.07%, ctx=51, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4677531,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4872MiB/s (5109MB/s), 4872MiB/s-4872MiB/s (5109MB/s-5109MB/s), io=71.4GiB (76.6GB), run=15001-15001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%